// TEMPLATE-COLLECTION.js
// All template definitions

const TEMPLATE_COLLECTION = {
    LAKHA_BANDHAK: {
        id: 'lakha-bandhak',
        name: 'लखबन्धक तमसुक',
        pages: {
            page1: {
                title: "पृष्ठ १ - मुख्य विवरण / लखबन्धक तमसुक ",
                template: "लिखितम् धनीका नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ऋणीकाे नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ले नगद नेपाली रूपैयाँ ----- अक्षेरेपी ----- कर्जा लिए वापत घर खर्च गर्न लिएकाे ठीक साँचाे हाे । याे रूपैयाँमा अरू कसैलाई केही गरी नदिएकाे मेराे हक भाेग दर्ताकाे ----- ----- भित्रकाे ----- खेत भन्ने राेपानी ----- जग्गा आजकाे मिति ----- देखि हक छाडी राजीनामा गरी दिँए । भाेग गर्न पाउनु भएन भने साँवा र ऐन बमाेजिमकाे ब्याज समेत मेराे अरू घरानाबाट असुल उपर गरी लिनु भनि मेराे मनाेमान खुशीराजीसँग तपाई साहूकै घर पिंढीमा बसी बायाँ किनारकाे साक्षीकाे राेहवरमा राजीनामा लेखी तपाई साहूलाई दिएँ र साक्षी किनारकाे सदर । याे राजीनामा ऐनकाे म्यादभित्र दर्ता गरी दिउला ।",
                placeholders: ["धनीको जिल्ला","नपा/गापा","धनीको वडा नं","धनीको उमेर","धनीको हजुरबुबा","धनीको बुबा","छोरा/छोरी","धनीको पुरा नाम","ऋणीको जिल्ला","नपा/गापा","ऋणीको वडा नं.","ऋणीको उमेर","ऋणीको हजुरबुबा","ऋणीको बुबा","छोरा/छोरी","ऋणीको पुरा नाम","रकम (अंकमा)","रकम (अक्षरमा)","जग्गाकाे ठेगाना जिल्ला","गा बि स वा न पा ","जग्गाकाे पहिचान नाम","जग्गाकाे नाप ","आजको मिति","तमसुक लेखेकाे साल","तमसुक लेखेकाे महिना","तमसुक लेखेकाे गते","तमसुक लेखेकाे बार अंकमा"]
            }
        },
        witness: {
            template: "\nदायाँ                     बायाँ\n                                         साक्षी\nसही ----- जिल्ला ----- वडा नं ----- मा बस्ने -----   \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने -----  \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने लेखक ----- \nप्रमाण पत्र नं ----- प्राप्त गरेकाे अदालत ----- ",
            placeholders: ["पहिलो साक्षीकाे बस्ने जिल्लाकाे नाम","पहिलो साक्षीकाे बस्ने गा पा वा न पा","पहिलो साक्षीकाे बस्ने वडा नंम्बर","पहिलो साक्षीकाे पुरा नाम","दोस्रो साक्षीकाे बस्ने जिल्लाकाे नाम","दोस्रो साक्षीकाे बस्ने गा पा वा न पा","दोस्रो साक्षीकाे बस्ने वडा नंम्बर","दोस्रो साक्षीकाे पुरा नाम","लेखक बस्ने जिल्लाकाे नाम","लेखक काे गा पा वा न पा","लेखक बस्ने वडा नं","लेखक काे पुरा नाम","लेखककाे लाइसेनकाे प्रमाण पत्र नं","लेखकले लाइसेन प्राप्त गरेकाे अदालतकाे नाम"]
        }
    },
    DRISTI_BANDHAK: {
        id: 'dristi-bandhak',
        name: 'दृष्टिबन्धक तमसुक',
        pages: {
            page1: {
                title: "पृष्ठ १ - मुख्य विवरण / दृष्टिबन्धक तमसुक ",
                template: "लिखितम् धनीका नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ऋणीकाे नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ले नगद नेपाली रूपैयाँ ----- अक्षेरेपी ----- कर्जा लिए वापत घर खर्च गर्न लिएकाे ठीक साँचाे हाे । याे रूपैयाँमा अरू कसैलाई केही गरी नदिएकाे मेराे हक भाेग दर्ताकाे ----- ----- भित्रकाे ----- खेत भन्ने राेपानी ----- जग्गा आजकाे मिति ----- देखि हक छाडी राजीनामा गरी दिँए । भाेग गर्न पाउनु भएन भने साँवा र ऐन बमाेजिमकाे ब्याज समेत मेराे अरू घरानाबाट असुल उपर गरी लिनु भनि मेराे मनाेमान खुशीराजीसँग तपाई साहूकै घर पिंढीमा बसी बायाँ किनारकाे साक्षीकाे राेहवरमा राजीनामा लेखी तपाई साहूलाई दिएँ र साक्षी किनारकाे सदर । याे राजीनामा ऐनकाे म्यादभित्र दर्ता गरी दिउला ।",
                placeholders: ["धनीको जिल्ला","नपा/गापा","धनीको वडा नं","धनीको उमेर","धनीको हजुरबुबा","धनीको बुबा","छोरा/छोरी","धनीको पुरा नाम","ऋणीको जिल्ला","नपा/गापा","ऋणीको वडा नं.","ऋणीको उमेर","ऋणीको हजुरबुबा","ऋणीको बुबा","छोरा/छोरी","ऋणीको पुरा नाम","रकम (अंकमा)","रकम (अक्षरमा)","जग्गाकाे ठेगाना जिल्ला","गा बि स वा न पा ","जग्गाकाे पहिचान नाम","जग्गाकाे नाप ","आजको मिति","तमसुक लेखेकाे साल","तमसुक लेखेकाे महिना","तमसुक लेखेकाे गते","तमसुक लेखेकाे बार अंकमा"]
            }
        },
        witness: {
            template: "\nदायाँ                     बायाँ\n                                         साक्षी\nसही ----- जिल्ला ----- वडा नं ----- मा बस्ने -----   \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने -----  \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने लेखक ----- \nप्रमाण पत्र नं ----- प्राप्त गरेकाे अदालत ----- ",
            placeholders: ["पहिलो साक्षीकाे बस्ने जिल्लाकाे नाम","पहिलो साक्षीकाे बस्ने गा पा वा न पा","पहिलो साक्षीकाे बस्ने वडा नंम्बर","पहिलो साक्षीकाे पुरा नाम","दोस्रो साक्षीकाे बस्ने जिल्लाकाे नाम","दोस्रो साक्षीकाे बस्ने गा पा वा न पा","दोस्रो साक्षीकाे बस्ने वडा नंम्बर","दोस्रो साक्षीकाे पुरा नाम","लेखक बस्ने जिल्लाकाे नाम","लेखक काे गा पा वा न पा","लेखक बस्ने वडा नं","लेखक काे पुरा नाम","लेखककाे लाइसेनकाे प्रमाण पत्र नं","लेखकले लाइसेन प्राप्त गरेकाे अदालतकाे नाम"]
        }
    },
    KAPALI_TAMSUK: {
        id: 'kapali-tamsuk',
        name: 'कपाली तमसुक',
        pages: {
            page1: {
                title: "पृष्ठ १ - मुख्य विवरण / कपाली तमसुक ",
                template: "लिखितम् धनीका नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ऋणीकाे नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ले नगद नेपाली रूपैयाँ ----- अक्षेरेपी ----- कर्जा लिए वापत घर खर्च गर्न लिएकाे ठीक हाे । याे रूपैयाँकाे व्याज  -----काे दरले बुझाउँला । साँवा व्याज बुझाउने भाखा ----- भयाे साे भाखामा बुझाउन नसकी भाखा नाघ्याे भने तपाई साहूकाे थैली प्रचलित नेपाल कानूनबमाेजिम मेराे घर घरानाबाट असूल उपर गरी लिनु भनी मेराे मनाेमान खुशीराजीसँग तपाई साहूकै घर पिंढी बसी कपाली तमसुक लेखी तपाई साहूलाई दिएँ । साक्षी बायाँ किनाराकाे सदर ।",
                placeholders: ["धनीको जिल्ला","नपा/गापा","धनीको वडा नं","धनीको उमेर","धनीको हजुरबुबा","धनीको बुबा","छोरा/छोरी","धनीको पुरा नाम","ऋणीको जिल्ला","नपा/गापा","ऋणीको वडा नं.","ऋणीको उमेर","ऋणीको हजुरबुबा","ऋणीको बुबा","छोरा/छोरी","ऋणीको पुरा नाम","रकम (अंकमा)","रकम (अक्षरमा)","ब्याजदर (%)","भाखा मिति","तमसुक लेखेकाे साल","तमसुक लेखेकाे महिना","तमसुक लेखेकाे गते","तमसुक लेखेकाे बार अंकमा"]
            }
        },
        witness: {
            template: "\nदायाँ                     बायाँ\n                                         साक्षी\nसही ----- जिल्ला ----- वडा नं ----- मा बस्ने -----   \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने -----  \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने लेखक ----- \nप्रमाण पत्र नं ----- प्राप्त गरेकाे अदालत ----- ",
            placeholders: ["पहिलो साक्षीकाे बस्ने जिल्लाकाे नाम","पहिलो साक्षीकाे बस्ने गा पा वा न पा","पहिलो साक्षीकाे बस्ने वडा नंम्बर","पहिलो साक्षीकाे पुरा नाम","दोस्रो साक्षीकाे बस्ने जिल्लाकाे नाम","दोस्रो साक्षीकाे बस्ने गा पा वा न पा","दोस्रो साक्षीकाे बस्ने वडा नंम्बर","दोस्रो साक्षीकाे पुरा नाम","लेखक बस्ने जिल्लाकाे नाम","लेखक काे गा पा वा न पा","लेखक बस्ने वडा नं","लेखक काे पुरा नाम","लेखककाे लाइसेनकाे प्रमाण पत्र नं","लेखकले लाइसेन प्राप्त गरेकाे अदालतकाे नाम"]
        }
    },
    RAJINAMA: {
        id: 'rajinama',
        name: 'राजीनामा',
        pages: {
            page1: {
                title: "पृष्ठ १ - मुख्य विवरण / राजीनामा",
                template: "लिखितम् धनीका नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ऋणीकाे नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ले नगद नेपाली रूपैयाँ ----- अक्षेपी ----- कर्जा लिए वापत घर खर्च गर्न लिएकाे ठीक साँचाे हाे । याे रूपैयाँमा अरू कसैलाई केही गरी नदिएकाे मेराे हक भाेग दर्ताकाे ----- ----- भित्रकाे ----- खेत भन्ने राेपानी ----- जग्गा आजकाे मिति ----- देखि हक छाडी राजीनामा गरी दिँए । भाेग गर्न पाउनु भएन भने साँवा र ऐन बमाेजिमकाे ब्याज समेत मेराे अरू घरानाबाट असुल उपर गरी लिनु भनि मेराे मनाेमान खुशीराजीसँग तपाई साहूकै घर पिंढीमा बसी बायाँ किनारकाे साक्षीकाे राेहवरमा राजीनामा लेखी तपाई साहूलाई दिएँ र साक्षी किनारकाे सदर । याे राजीनामा ऐनकाे म्यादभित्र दर्ता गरी दिउला ।",
                placeholders: ["धनीको जिल्ला","नपा/गापा","धनीको वडा नं","धनीको उमेर","धनीको हजुरबुबा","धनीको बुबा","छोरा/छोरी","धनीको पुरा नाम","ऋणीको जिल्ला","नपा/गापा","ऋणीको वडा नं.","ऋणीको उमेर","ऋणीको हजुरबुबा","ऋणीको बुबा","छोरा/छोरी","ऋणीको पुरा नाम","रकम (अंकमा)","रकम (अक्षरमा)","जग्गाकाे ठेगाना जिल्ला","गा बि स वा न पा ","जग्गाकाे पहिचान नाम","जग्गाकाे नाप ","आजको मिति","तमसुक लेखेकाे साल","तमसुक लेखेकाे महिना","तमसुक लेखेकाे गते","तमसुक लेखेकाे बार अंकमा"]
            }
        },
        witness: {
            template: "\nदायाँ                     बायाँ\n                                         साक्षी\nसही ----- जिल्ला ----- वडा नं ----- मा बस्ने -----   \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने -----  \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने लेखक ----- \nप्रमाण पत्र नं ----- प्राप्त गरेकाे अदालत ----- ",
            placeholders: ["पहिलो साक्षीकाे बस्ने जिल्लाकाे नाम","पहिलो साक्षीकाे बस्ने गा पा वा न पा","पहिलो साक्षीकाे बस्ने वडा नंम्बर","पहिलो साक्षीकाे पुरा नाम","दोस्रो साक्षीकाे बस्ने जिल्लाकाे नाम","दोस्रो साक्षीकाे बस्ने गा पा वा न पा","दोस्रो साक्षीकाे बस्ने वडा नंम्बर","दोस्रो साक्षीकाे पुरा नाम","लेखक बस्ने जिल्लाकाे नाम","लेखक काे गा पा वा न पा","लेखक बस्ने वडा नं","लेखक काे पुरा नाम","लेखककाे लाइसेनकाे प्रमाण पत्र नं","लेखकले लाइसेन प्राप्त गरेकाे अदालतकाे नाम"]
        }
    },
    RE_RAJINAMA: {
        id: 're-rajinama',
        name: 'पुनः राजीनामा (हराएमा)',
        pages: {
            page1: {
                title: "पृष्ठ १ - मुख्य विवरण / राजीनामा हराएमा व्यहाेरा जनाई गरिदिएकाे राजीनामा",
                template: "लिखितम् धनीका नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ऋणीकाे नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ले नगद नेपाली रूपैयाँ ----- अक्षेरेपी ----- कर्जा लिए वापत घर खर्च गर्न लिएकाे, साे रूपैयाँमा मेराे नाममा दर्ता भएकाे ----- ----- वडा नं ----- काे कि नं ----- काे ----- ----- ----- ----- तपाई  साहूकाे जग्गा यति ----- किल्ला भित्रकाे ----- भन्ने राेपानी ----- जग्गा तपाई  साहूलाई  मैले रू ----- मा ----- मा राजीनामा  गरी दिएकाे ----- मा -----भएकाेले व्यहाेरा जनाई याे अर्काे गरिदिनुहाेस् भनी आजको मितिमा भन्नु भएकाले उक्त चाेरी भएकाेले व्यहाेरा जनाई याे अर्काे राजीनामा गरी दिएकाे छु । अघिकै मितिकाे राजीनामा सरह याे राजीनामा बाट पनि साे जग्गा तपाई साहूले भाेग गर्नु । भाेग गर्दा कच्चा ठहरे साहूकाे थैली ऐन बमाेजिम मेराे घर घरानाबाट उपर गरी लिनु भनी मेरै घर पिंढीमा बसी बायाँ किनाराकाे साक्षीका राेहवरमा राजीनामा लेखी तपाई साहूलाई दिए ।",
                placeholders: ["धनीको जिल्ला","नपा/गापा","धनीको वडा नं","धनीको उमेर","धनीको हजुरबुबा","धनीको बुबा","छोरा/छोरी","धनीको पुरा नाम","ऋणीको जिल्ला","नपा/गापा","ऋणीको वडा नं.","ऋणीको उमेर","ऋणीको हजुरबुबा","ऋणीको बुबा","छोरा/छोरी","ऋणीको पुरा नाम","रकम (अंकमा)","रकम (अक्षरमा)","जिल्लाकाे नाम ","गा बि स वा न पा ","वडा नं ","कित्ता नं ","चार दिसा मध्ये एक काे जग्गाकाे ठेगना ","चार दिसा मध्ये एक काे जग्गाकाे ठेगना ","चार दिसा मध्ये एक काे जग्गाकाे ठेगना ","चार दिसा मध्ये एक काे जग्गाकाे ठेगना ","किल्लाकाे नाप अंकमा "," राेपानी जग्गाकाे नाम "," राेपानी काे नाप क्षेत्रपफल अंकमा  "," जग्गा बेचेकाे मुल्य रकम अंकमा ","जग्गा बेचेकाे पुरा मिति","राजीनामा चाेरी वा हराएकाे भएकाे पुरा मिति"," हराएकाे वा चाेरी भएकाे ","तमसुक लेखेकाे साल","तमसुक लेखेकाे महिना","तमसुक लेखेकाे गते","तमसुक लेखेकाे बार अंकमा"]
            }
        },
        witness: {
            template: "\nदायाँ                     बायाँ\n                                         साक्षी\nसही ----- जिल्ला ----- वडा नं ----- मा बस्ने -----   \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने -----  \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने लेखक ----- \nप्रमाण पत्र नं ----- प्राप्त गरेकाे अदालत ----- ",
            placeholders: ["पहिलो साक्षीकाे बस्ने जिल्लाकाे नाम","पहिलो साक्षीकाे बस्ने गा पा वा न पा","पहिलो साक्षीकाे बस्ने वडा नंम्बर","पहिलो साक्षीकाे पुरा नाम","दोस्रो साक्षीकाे बस्ने जिल्लाकाे नाम","दोस्रो साक्षीकाे बस्ने गा पा वा न पा","दोस्रो साक्षीकाे बस्ने वडा नंम्बर","दोस्रो साक्षीकाे पुरा नाम","लेखक बस्ने जिल्लाकाे नाम","लेखक काे गा पा वा न पा","लेखक बस्ने वडा नं","लेखक काे पुरा नाम","लेखककाे लाइसेनकाे प्रमाण पत्र नं","लेखकले लाइसेन प्राप्त गरेकाे अदालतकाे नाम"]
        }
    },
    VOG_BANDHAK: {
        id: 'vog-bandhak',
        name: 'भाेगबन्धक तमसुक',
        pages: {
            page1: {
                title: "पृष्ठ १ - मुख्य विवरण / भाेगबन्धक तमसुक",
                template: "लिखितम् धनीका नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ऋणीकाे नाम ----- जिल्ला ----- वडा नं  ----- बस्ने बर्ष ----- काे  ----- काे नाति ----- काे ----- ----- ले नगद नेपाली रूपैयाँ ----- अक्षेपी ----- कर्जा लिए वापत घर खर्च गर्न लिएकाे ठीक साँचाे हाे । याे रूपैयाँमा अरू कसैलाई केही गरी नदिएकाे मेराे हक भाेग दर्ताकाे ----- ----- भित्रकाे ----- खेत भन्ने राेपानी ----- जग्गा आजकाे मिति ----- देखि हक छाडी राजीनामा गरी दिँए । भाेग गर्न पाउनु भएन भने साँवा र ऐन बमाेजिमकाे ब्याज समेत मेराे अरू घरानाबाट असुल उपर गरी लिनु भनि मेराे मनाेमान खुशीराजीसँग तपाई साहूकै घर पिंढीमा बसी बायाँ किनारकाे साक्षीकाे राेहवरमा राजीनामा लेखी तपाई साहूलाई दिएँ र साक्षी किनारकाे सदर । याे राजीनामा ऐनकाे म्यादभित्र दर्ता गरी दिउला । इति सम्वत् ----- साल ----- ----- गते राेज ----- शुभम् ।",
                placeholders: ["धनीको जिल्ला","नपा/गापा","धनीको वडा नं","धनीको उमेर","धनीको हजुरबुबा","धनीको बुबा","छोरा/छोरी","धनीको पुरा नाम","ऋणीको जिल्ला","नपा/गापा","ऋणीको वडा नं.","ऋणीको उमेर","ऋणीको हजुरबुबा","ऋणीको बुबा","छोरा/छोरी","ऋणीको पुरा नाम","रकम (अंकमा)","रकम (अक्षरमा)","जग्गाकाे ठेगाना जिल्ला","गा बि स वा न पा ","जग्गाकाे पहिचान नाम","जग्गाकाे नाप ","आजको मिति","तमसुक लेखेकाे साल","तमसुक लेखेकाे महिना","तमसुक लेखेकाे गते","तमसुक लेखेकाे बार अंकमा"]
            }
        },
        witness: {
            template: "\nदायाँ                     बायाँ\n                                         साक्षी\nसही ----- जिल्ला ----- वडा नं ----- मा बस्ने -----   \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने -----  \nसही ए ----- जिल्ला ----- वडा नं ----- मा बस्ने लेखक ----- \nप्रमाण पत्र नं ----- प्राप्त गरेकाे अदालत ----- ",
            placeholders: ["पहिलो साक्षीकाे बस्ने जिल्लाकाे नाम","पहिलो साक्षीकाे बस्ने गा पा वा न पा","पहिलो साक्षीकाे बस्ने वडा नंम्बर","पहिलो साक्षीकाे पुरा नाम","दोस्रो साक्षीकाे बस्ने जिल्लाकाे नाम","दोस्रो साक्षीकाे बस्ने गा पा वा न पा","दोस्रो साक्षीकाे बस्ने वडा नंम्बर","दोस्रो साक्षीकाे पुरा नाम","लेखक बस्ने जिल्लाकाे नाम","लेखक काे गा पा वा न पा","लेखक बस्ने वडा नं","लेखक काे पुरा नाम","लेखककाे लाइसेनकाे प्रमाण पत्र नं","लेखकले लाइसेन प्राप्त गरेकाे अदालतकाे नाम"]
        }
    },
};

// Template selection key for localStorage
const TEMPLATE_SELECTION_KEY = 'rxStudioSelectedTemplate';

// Default template to use if none selected
const DEFAULT_TEMPLATE_ID = 'lakha-bandhak';